---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralMaterialParam
source: html/f813fcd2-3fd9-c587-ed7b-1fd5e9245600.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralMaterialParam Property

"Structural Material"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralMaterialParam { get; }
```